In [100]:
import pandas as pd

In [108]:
df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33], 
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [55]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [56]:
df.columns

Index(['name', 'age', 'state', 'num_children', 'num_pets'], dtype='object')

In [7]:
df[['name', 'age', 'state']]

    name  age       state
0   john   23        iowa
1   mary   78          dc
2  peter   22  california
3   jeff   19       texas
4   bill   45  washington
5   lisa   33          dc

In [8]:
df.loc[2:4, 'name']

2    peter
3     jeff
4     bill
Name: name, dtype: object

In [9]:
# select the last 2 rows
df.iloc[:2]

   name  age state  num_children  num_pets
0  john   23  iowa             2         0
1  mary   78    dc             2         4

In [10]:
df.loc[2:4, ['name', 'age']]

    name  age
2  peter   22
3   jeff   19
4   bill   45

In [11]:
df.iloc[-2:]

   name  age       state  num_children  num_pets
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [13]:
# select rows up to and including the one
# with index = 2 (this retrieves 3 rows)
df.loc[:2]

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0

In [16]:
# first column of the data frame
df.iloc[:,0] #using a comma allows you to specify column and row? --> Need to confirm

0     john
1     mary
2    peter
3     jeff
4     bill
5     lisa
Name: name, dtype: object

In [22]:
df.loc[:,['age','state']]
# df.loc[0:2, ['age', 'state']]

   age       state
0   23        iowa
1   78          dc
2   22  california
3   19       texas

In [23]:
# people whose "age" is greater than 30
df[df['age'] > 30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [24]:
# people whose "age" is greater than 30
df[df.age>30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [27]:
df[df.num_pets > df.num_children]

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

In [36]:
df[(df.age > 40) | (df.num_pets > 0)]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
3  jeff   19       texas             1         5
4  bill   45  washington             2         0

In [65]:
df.drop(["age", "num_children"], axis=1) #doesn't affect the original df-frame

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0

In [68]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [74]:
df[['age', 'num_children']].mean()

age             36.666667
num_children     1.333333
dtype: float64

In [76]:
df.describe()

             age  num_children  num_pets
count   6.000000      6.000000  6.000000
mean   36.666667      1.333333  1.500000
std    22.384518      0.816497  2.345208
min    19.000000      0.000000  0.000000
25%    22.250000      1.000000  0.000000
50%    28.000000      1.500000  0.000000
75%    42.000000      2.000000  3.000000
max    78.000000      2.000000  5.000000

In [82]:
type(df['age'])

pandas.core.series.Series

In [80]:
type(df[['age']])

pandas.core.frame.DataFrame

In [85]:
df[["age"]]*2

   age
0   46
1  156
2   44
3   38
4   90
5   66

In [93]:
df["age"].apply(lambda value: (value*2) + 23)

0     69
1    179
2     67
3     61
4    113
5     89
Name: age, dtype: int64

In [104]:
df[["age"]]

   age
0   10
1   20
2   30
3   40
4   50
5   60

In [113]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [123]:
#Change just one column's values
df["age"] = df[["age"]]*2

In [128]:
# Sort entire datadrame by age in ascending order
df.sort_values("age", ascending=True)

    name  age       state  num_children  num_pets
3   jeff  152       texas             1         5
2  peter  176  california             0         0
0   john  184        iowa             2         0
5   lisa  264          dc             1         0
4   bill  360  washington             2         0
1   mary  624          dc             2         4

In [131]:
# select rows whose name begins with the letter 'j'
df[df.name.str.startswith('j')]

   name  age  state  num_children  num_pets
0  john  184   iowa             2         0
3  jeff  152  texas             1         5

In [134]:
# Using Piviot Tables in Pandas
from collections import OrderedDict
from pandas import DataFrame
import pandas as pd
import numpy as np

table = OrderedDict((
    ("Item", ['Item0', 'Item0', 'Item1', 'Item1']),
    ('CType',['Gold', 'Bronze', 'Gold', 'Silver']),
    ('USD',  ['1$', '2$', '3$', '4$']),
    ('EU',   ['1€', '2€', '3€', '4€'])
))
d = DataFrame(table)

In [136]:
d

    Item   CType USD  EU
0  Item0    Gold  1$  1€
1  Item0  Bronze  2$  2€
2  Item1    Gold  3$  3€
3  Item1  Silver  4$  4€

In [138]:
p = d.pivot(index='Item', columns='CType', values='USD')

In [139]:
p

CType Bronze Gold Silver
Item
Item0     2$   1$    NaN
Item1    NaN   3$     4$